###########################################################
###########################################################
####                                                   ####
####             Скрипт для автоматического            ####
####           обнаружения сайтов и пулов IIS          ####
####                                                   ####
###########################################################
###########################################################

#Описание принимаемых параметров. В сущность что обнаруживаем? 
#Сайты или пулы?
Param (
    [Parameter (Mandatory=$true, Position=1)]
    [string]$WebItem
)

#Импорт модуля управления IIS
Import-Module WebAdministration

switch ($WebItem) 
    {
        "Website" { Get-Website | ForEach-Object { $_.name } }
        "Pools"   { Get-WebApplication | ForEach-Object { $_.applicationPool } }
    }
